{
  "latest_id": 2,
  "projects": {
    "games": [
    ],
    "software": [
      {
        "id": 1,
        "title": "Dialogue Tool: Eenvoudig interactieve gesprekken maken voor je game",
        "author": "nxbi",
        "highlightedPos": 1,
        "content": [
          {
            "type": 1,
            "content": "Onze Dialogue Tool is een project ontwikkeld met C# en C++, gecombineerd met een Razor frontend. Het is ontworpen om binnen een applicatie te draaien en geeft ontwikkelaars de mogelijkheid om interactieve “chats” te creëren tussen gamecharacters."
          },
          {
            "type": 1,
            "content": "Wat maakt deze tool anders? In plaats van traditionele scriptbestanden of losse dialogen, kun je met deze tool gesprekken schrijven in een overzichtelijke, WhatsApp-achtige interface. Dit maakt het makkelijker en intuïtiever om realistische dialogen op te zetten tussen personages."
          },
          {
            "type": 1,
            "content": "De gemaakte chats worden opgeslagen als JSON-bestanden. Deze JSON wordt vervolgens uitgelezen door een Unity dependency, zodat de dialogen direct in de game afgespeeld kunnen worden via een zelf ontworpen gebruikersinterface. Hierdoor kun je gesprekken dynamisch laten verlopen en hoef je niet meer te worstelen met ingewikkelde code of losse tekstbestanden."
          },
          {
            "type": 1,
            "content": "Door deze aanpak versnellen we het ontwikkelproces, verbeteren we de overzichtelijkheid van dialogen, en bieden we meer flexibiliteit om verhalen te vertellen die écht tot leven komen in de game."
          }
        ]
      },
      {
        "id": 2,
        "title": "Texture Repacker: Makkelijk Minecraft texturepacks omzetten",
        "author": "<null/>",
        "highlightedPos": 2,
        "content": [
          {
            "type": 1,
            "content": "Texture Repacker is een Java-project waarmee je Minecraft texturepacks tussen verschillende versies kunt omzetten. Zo hoef je maar één keer een texturepack te maken voor de nieuwste versie, en met deze tool kun je ‘m eenvoudig klaarmaken voor oudere versies."
          },
          {
            "type": 1,
            "content": "Je geeft de tool een opdracht in de command line, bijvoorbeeld zo:"
          },
          {
            "type": 1,
            "content": "Repack gevolgd door -packDir, dan de locatie van het texturepack,"
          },
          {
            "type": 1,
            "content": "daarna -from met de versie waar je vandaan komt,"
          },
          {
            "type": 1,
            "content": "en -to met de versie waar je naartoe wilt converteren."
          },
          {
            "type": 1,
            "content": "Met -saveDir geef je aan waar het resultaat moet komen te staan."
          },
          {
            "type": 1,
            "content": "Een voorbeeld:"
          },
          {
            "type": 2,
            "content": "./assets/img/repack_example.png"
          },
          {
            "type": 1,
            "content": "Dat betekent: pak het texturepack voor versie 1.20.1, zet het om naar 1.14.2, en sla het op in de map downloads."
          },
          {
            "type": 1,
            "content": "Het doel is dat texture artists zo minder tijd kwijt zijn aan aanpassen, en meer tijd kunnen steken in het maken van toffe packs."
          },
          {
            "type": 1,
            "content": "We zijn nu vooral bezig met de command line versie, maar in de toekomst wil ik er ook een gebruiksvriendelijke UI aan koppelen. Ook is het plan om versies later auto te detecteren zodat je alleen hoeft aan te geven naar welke versie je wilt omzetten."
          }
        ]
      }
    ]
  },
  "posts": [
  ],
  "about": {
    "aboutus": {
      "id": 0,
      "title": "Over ons",
      "banner": "",
      "content": [
        {
          "type": 1,
          "content": "Entropy Entertainment is een klein, ambitieus team van drie studenten met een passie voor gamedevelopment. Twee van ons volgen een opleiding gamedevelopment en de derde studeert software development. We richten ons op het maken van games en tools die niet alleen leuk zijn, maar ook echt iets toevoegen voor spelers en ontwikkelaars."
        },
        {
          "type": 1,
          "content": "Hoewel we nog geen afgeronde projecten hebben om te laten zien, zijn we volop bezig met nieuwe ideeën en schoolprojecten die daar verandering in gaan brengen. Op dit moment werken we onder andere aan een dialoog tool en de TextureRepacker."
        }
      ]
    },
    "profiles": [
    ]
  }
}